I see this issue with changes in default_tags which can be annoying if you have a lot of policy documents in a single directory.

```diff
  # data.aws_iam_policy_document.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "default" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "events:PutEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:events:us-east-1:snip:event-bus/guardduty",
            ]
+           sid       = "snip"

+           principals {
+               identifiers = [
+                   "snip",
                ]
+               type        = "AWS"
            }
        }
    }

  # aws_cloudwatch_event_bus_policy.default will be updated in-place
! resource "aws_cloudwatch_event_bus_policy" "default" {
        id             = "guardduty"
!       policy         = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "events:PutEvents"
-                       Effect    = "Allow"
-                       Principal = {
-                           AWS = "arn:aws:iam::snip:root"
                        }
-                       Resource  = "arn:aws:events:us-east-1:snip:event-bus/guardduty"
-                       Sid       = "snip"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }
```